<?php
$information_of_student = array(
  array(
    'firstname'=>'Бат-Оргил',
    'lastname'=> 'Даваажанцан',
    'sisi'=> '16b1seas0807',
    'profession' => 'Програм хангамж',
    'lessons' => array(
      'Магадлал статик',
      'Веб програмчлал',
      'Объект хандалтат програмчлал',
      'Өгөгдлийн бүтэц',
      'Програм хангамжийн төслийн баримт бичиг',
      'Хүн компютерийн харилцаа',
    ),
  ),
  array(
    'firstname'=>'Болд',
    'lastname'=> 'Галбаатар',
    'sisi'=> '16b1seas2014',
    'profession' => 'Програм хангамж',
    'lessons' => array(
      'Үйлдэлийн системийн олон',
      'Магадлал статик',
      'Веб програмчлал',
      'Алгоритмийн үндэс',
      'Өгөгдлийн сангын үндэс',
      'Сүлжээний үндэс',
      'Хүн компютерийн харилцаа',
    ),
  ),
  array(
    'firstname'=>'Бархас',
    'lastname'=> 'Гончиг',
    'sisi'=> '16b1seas0954',
    'profession' => 'Програм хангамж',
    'lessons' => array(
      'Интернет технологийн үндэс',
      'С програмчлал',
      'Веб програмчлал',
      'Алгоритмийн үндэс',
      'Өгөгдлийн сангын үндэс',
      'Сүлжээний үндэс',
      'Хүн компютерийн харилцаа',
    ),
  ),
  array(
    'firstname'=>'Уянга',
    'lastname'=> 'Баатар',
    'sisi'=> '16b1seas0554',
    'profession' => 'Нябо',
    'lessons' => array(
      'Маркетингйин үндэс',
      'Олон улсийн харилцаа',
      'Ангил хэл',
      'Микроэкономик',
      'Монголийн түүх',
    ),
  ),
  array(
    'firstname'=>'Олдох',
    'lastname'=> 'Гаваапил',
    'sisi'=> '16b1seas0994',
    'profession' => 'Хот төлөлвлөлт',
    'lessons' => array(
      'Эдийн засгийн үндэс',
      'Олон улсийн харилцаа',
      'Ангил хэл',
      'Дипломат харилцаа',
      'Монголийн түүх',
      'Баримт бичиг боловсруулалт'
    ),
  ),
  array(
    'firstname'=>'Билэгт',
    'lastname'=> 'Хүрлээ',
    'sisi'=> '16b1seas0114',
    'profession' => 'Мэдээлэлийн систем',
    'lessons' => array(
      'Мэдээллийн системийн шаардлагийн шинжилгээ',
      'Мэдээллийн системийн удирдлага',
      'Веб програмчлал',
      'Хүн ба компютерийн харилцаа',
      'Монголийн түүх',
      'Баримт бичиг боловсруулалт'
    ),
  ),
  array(
    'firstname'=>'Саруул',
    'lastname'=> 'Энэбиш',
    'sisi'=> '16b1seas0108',
    'profession' => 'Програм хангамж',
    'lessons' => array(
      'Мэдээллийн системийн шаардлагийн шинжилгээ',
      'Мэдээллийн системийн удирдлага',
      'Алгоритмийн үндэс',
      'Өгөгдлийн сангын үндэс',
      'Сүлжээний үндэс',
      'Хүн компютерийн харилцаа',
    ),
  ),
  array(
    'firstname'=>'Ааруул',
    'lastname'=> 'Лувсан',
    'sisi'=> '16b1seas0186',
    'profession' => 'Програм хангамж',
    'lessons' => array(
      'Мэдээллийн системийн шаардлагийн шинжилгээ',
      'Мэдээллийн системийн удирдлага',
      'Алгоритмийн үндэс',
      'Өгөгдлийн сангын үндэс',
      'Сүлжээний үндэс',
      'Хүн компютерийн харилцаа',
    ),
  ),
  array(
    'firstname'=>'Саруул',
    'lastname'=> 'Бод',
    'sisi'=> '16b1seas0008',
    'profession' => 'Програм хангамж',
    'lessons' => array(
      'Мэдээллийн системийн шаардлагийн шинжилгээ',
      'Мэдээллийн системийн удирдлага',
      'Алгоритмийн үндэс',
      'Өгөгдлийн сангын үндэс',
      'Сүлжээний үндэс',
      'Хүн компютерийн харилцаа',
    ),
  ),
);
$lessons = array(
  array(
    'id'=>'ISO123',
    'lname' => 'Үйлдэлийн системийн олон',
    'cerdit' => '3',
  ),
  array(
    'id' => 'ISO113',
    'lname' => 'Магадлал статик',
    'cerdit' => '3',
  ),
  array(
    'id'=>'ISP093',
    'lname' => 'Веб програмчлал',
    'cerdit' => '3',
  ),
  array(
    'id'=> 'ISP103',
    'lname' => 'Объект хандалтат програмчлал',
    'cerdit' => '3',
  ),
  array(
    'id'=>'OSP093',
    'lname' => 'Өгөгдлийн бүтэц',
    'cerdit' => '3',
  ),
  array(
    'id'=>'OSP804',
    'lname' => 'Програм хангамжийн төслийн баримт бичиг',
    'cerdit' => '2',
  ),
  array(
    'id'=>'OSP895',
    'lname' => 'Хүн компютерийн харилцаа',
    'cerdit' => '2',
  ),
  array(
    'lname' => 'Алгоритмийн үндэс',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Өгөгдлийн сангын үндэс',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Сүлжээний үндэс',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'С програмчлал',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Интернет технологийн үндэс',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Маркетингйин үндэс',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Олон улсийн харилцаа',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Ангил хэл',
    'cerdit' => '1',
  ),
  array(
    'lname' => 'Микроэкономик',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Монголийн түүх',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Эдийн засгийн үндэс',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Дипломат харилцаа',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Баримт бичиг боловсруулалт',
    'cerdit' => '3',
  ),
  array(
    'lname' => 'Мэдээллийн системийн шаардлагийн шинжилгээ',
    'cerdit' => '2',
  ),
  array(
    'lname' => 'Мэдээллийн системийн удирдлага',
    'cerdit' => '2',
  ),
);
echo '<h1>Student ruu orov</h1><pre>';

echo "<table>
        <tr>
          <th>sisi</th>
          <th>profession</th>
          <th>firstname</th>
          <th>lastname</th>
          <th>lessons</th>
        </tr>
        ";

        foreach($information_of_student as $student){
          echo "<tr>";
          echo "<td>$student[sisi]</td> <td>$student[profession]</td> <td>$student[firstname]</td> <td>$student[lastname]</td>
          <td>";
          foreach($student['lessons'] as $onelesson){
            foreach($lessons as $ln){
              if($onelesson == $ln['lname']){
                echo "$onelesson      $ln[cerdit]<br>";
              }
            }
          }
          echo '</td></tr>';
        }

echo '</table></pre>';



?>
